{
    "Header.Item1": "About me",
    "Header.Item2": "Experience",
    "Header.Item3": "Projects",
    "Header.Item4": "Education",
    "Header.Item5": "Contact",
    "Header.cvBtn": "Resume",
    "Header.cvName": "MosenithHeangResume.pdf",
    "Banner.Pretitle": "Hello! My name is",
    "Banner.Description": "As a Full Stack .NET Developer with over 4 years of experience, I specialize in building scalable enterprise applications using <span class='underline'>C#, .NET 8.0, Entity Framework Core, React, and Angular</span>. <br><br> My work spans across developing secure <span class='underline'>RESTful APIs</span>, designing efficient databases, and delivering solutions on cloud platforms like <span class='underline'>AWS</span>, with CI/CD pipelines powered by <span class='underline'>Azure DevOps</span>.",
    "Banner.ActionBtn": "Get in touch",
    "AboutMe.Title": "About me",
    "AboutMe.Paragraphs": [
        "With over 4 years of experience, I specialize in full stack development using <span class='underline'>C#, .NET 8.0, ASP.NET Core, Entity Framework Core, React.js,</span> and <span class='underline'>Angular</span>. I’ve contributed to enterprise applications involving microservices, modernization, and large-scale data handling.",
        "I build secure <span class='underline'>RESTful APIs</span>, migrate legacy systems, and apply patterns like <span class='underline'>CQRS</span> and <span class='underline'>DDD</span> to deliver scalable backend solutions.",
        "My expertise extends to <span class='underline'>cloud platforms</span> like <span class='underline'>AWS, GCP</span>, and tools such as <span class='underline'>Azure DevOps</span> and <span class='underline'>Docker</span> for CI/CD.",
        "I’m proficient with <span class='underline'>SQL and NoSQL databases</span> including <span class='underline'>SQL Server, PostgreSQL, MySQL,</span> and <span class='underline'>MongoDB</span>, and have academic exposure to <span class='underline'>NLP</span> and <span class='underline'>Machine Learning</span>."
    ],
    "Experience.Title": "Experience",
    "Experience.Jobs": [
        {
            "Tab": "Deloitte",
            "Title": "Full Stack .NET Developer",
            "Date": "Sep 2024 - Present",
            "Description": [
                "Worked closely with technical leads and stakeholders to understand requirements and shape system functionality.",
                "Developed and integrated backend APIs using C# and Entity Framework Core, while modernizing older .NET 4 services.",
                "Built and supported scalable .NET 8.0 applications, connecting backend logic with SQL Server for data operations.",
                "Improved database performance by tuning stored procedures and streamlining queries.",
                "Enhanced React.js components by adding new features and fixing usability issues.",
                "Created Python scripts to automate data validation and generate dynamic Excel and PDF reports."
            ]
        },
        {
            "Tab": "Simpaz",
            "Title": "Full Stack .NET Developer",
            "Date": "Feb 2024 - Jun 2024",
            "Description": [
                "Collaborated with teams, including developers and product managers, to gather requirements and translate them into functional UI components.",
                "Designed and implemented user-friendly and responsive UI components for multiple features, including location and languages, using Angular, TypeScript, and JavaScript.",
                "Developed and maintained backend applications using ASP.NET Core and C# to support the frontend UI components.",
                "Implemented RESTful APIs and services to facilitate data exchange between the frontend and backend systems.",
                "Utilized Object-Relational Mapping (ORM) techniques and repositories to map input data to database (MS SQL) entities.",
                "Followed industry-standard coding practices, including version control with Azure DevOps, code reviews, and continuous integration/continuous deployment (CI/CD) pipelines."
            ]
        },
        {
            "Tab": "OneStop",
            "Title": "Software Engineer (Full Stack - Java)",
            "Date": "Jan 2022 - Sep 2022, August 2023 - Jan 2024",
            "Description": [
                "Refactored monolithic applications (Java, C#, and ASP.NET Core) to distributed applications using Java and Spring Boot Framework.",
                "Developed responsive front-end interfaces with Angular, TypeScript, CSS3, HTML5, and JavaScript.",
                "Built and maintained RESTful APIs using Spring Boot and Spring MVC.",
                "Designed and implemented secure DBMS using Spring Data JPA and Hibernate.",
                "Utilized monitoring tools like Spring Boot Actuator and ELK Stack (Elasticsearch, Logstash, Kibana) for proactive issue identification.",
                "Wrote comprehensive unit tests for APIs using JUnit and Mockito.",
                "Created CI/CD pipelines with AWS EC2 and Azure DevOps."
            ]
        },
        {
            "Tab": "Lunasa",
            "Title": "Software Engineer",
            "Date": "Jan 2020 - Aug 2022",
            "Description": [
                "Designed, implemented, and tested new features to a position tracker web applications using C#, ASP.NET Core, Angular, and TypeScript.",
                "Utilized ActiveMQ for messaging and asynchronous communication between the web application and other backend systems.",
                "Maintained existing applications and helped diagnose problems in the development process.",
                "Retrieved all the available locations of public facilities, convert to readable format and store in database using SQL and NoSQL databases.",
                "Co-developed custom Java SE application services for users to view GPS information using C# and ASP.NET Core.",
                "Co-developed and tested a Java-based custom map application utilizing GIS technologies."
            ]
        }
    ],
    "OtherProjects.Title": "My personal projects",
    "OtherProjects.Projects": [
        {
            "Title": "LeetCode Problems",
            "Description": "A collection of solutions to various LeetCode problems, showcasing problem-solving skills and proficiency in algorithms and data structures.",
            "ghLink": "https://github.com/Mosenith/LeetCodeProblems",
            "Technologies": [
                "Java",
                "C#",
                "Python",
                "Algorithms",
                "Data Structures"
            ]
        },
        {
            "Title": "Online Retail System",
            "Description": "A Java-based web application for an online retail system using the Spring Boot framework. It provides a seamless shopping experience with features like product management, order processing, and user account management.",
            "ghLink": "https://github.com/Mosenith/Online-Retail-System",
            "Technologies": [
                "Java",
                "Spring Boot",
                "JPA",
                "MySQL",
                "RESTful Web Services",
                "JWT Tokens",
                "JWT",
                "JUnit"
            ]
        },
        {
            "Title": "Stockify",
            "Description": "A dynamic and engaging stock web application designed to provide real-time stock information and visualizations. This project demonstrates your ability to work with TypeScript and C#, and to create interactive web applications.",
            "ghLink": "https://github.com/Mosenith/stockify",
            "Technologies": [
                "C#",
                "ASP.NET Core",
                "Angular",
                "TypeScript",
                "JavaScript"
            ]
        },
        {
            "Title": "Data Input Services",
            "Description": "A microservice web application designed to handle data input services. This project utilizes a microservices architecture, incorporating technologies such as Kafka, Spring Framework, and Zuul API Gateway.",
            "ghLink": "https://github.com/Mosenith/DataInputServices",
            "Technologies": [
                "Java",
                "Spring Boot Framework",
                "Kafka",
                "Microservices",
                "Zuul API Gateway",
                "JavaScript"
            ]
        },
        {
            "Title": "Segmentation CRF Khmer",
            "Description": "Word segmentation for Khmer documents using Conditional Random Fields (CRF). This project includes various implementations using CRF, Hidden Markov Models (HMM), and other sklearn algorithms to achieve high accuracy in word segmentation.",
            "ghLink": "https://github.com/Mosenith/segmentation-crf-khmer",
            "Technologies": [
                "Python",
                "Word2Vec",
                "HMM",
                "CRF",
                "SVM",
                "Natural Language Processing (NLP)",
                "sklearn Algorithms"
            ]
        }
    ],
    "Education.Title": "Education",
    "Education.List": [
        {
            "Degree": "Master of Science - Computer Science",
            "Institution": "Maharishi International University, Fairfield, Iowa",
            "Date": "11/2022 - 06/2025",
            "Description": "In progress via distance education, expected completion is 2025"
        },
        {
            "Degree": "Bachelor of Engineering - Computer Science",
            "Institution": "Osaka Prefecture University, Osaka, Japan",
            "Date": "04/2019 - 03/2022"
        },
        {
            "Degree": "Associate of Science - Information Technology",
            "Institution": "Osaka Information and Computer Science College, Osaka, Japan",
            "Date": "04/2017 - 03/2019"
        }
    ],
    "Contact.Pretitle": "Let's Connect",
    "Contact.Title": "Reach Out to Me!",

    
    "Contact.Content": [
        "I'm currently working as a Full Stack .NET Developer at Deloitte, contributing to enterprise-grade applications and backend systems.",
        "While I’m not actively seeking new roles, I’m open to hearing about exciting opportunities or collaborations that align with my skills and experience."
    ],
    "Contact.Btn": "Send a Message"
}